Q1. List any five functions of the pandas library with execution.

1) read_csv : To read the csv file

In [1]:
# import module
import pandas as pd

# assign dataset
df = pd.read_csv("country_code.csv")

# display
print("Type-", type(df))
df

Type- <class 'pandas.core.frame.DataFrame'>

                  Name Code
0          Afghanistan   AF
1        Åland Islands   AX
2              Albania   AL
3              Algeria   DZ
4       American Samoa   AS
..                 ...  ...
244  Wallis and Futuna   WF
245     Western Sahara   EH
246              Yemen   YE
247             Zambia   ZM
248           Zimbabwe   ZW

[249 rows x 2 columns]

2) Head

We can read the dataframe by using head() function also which is having an argument (n) i.e. number of rows to be displayed.

In [2]:
df.head(10)

                  Name Code
0          Afghanistan   AF
1        Åland Islands   AX
2              Albania   AL
3              Algeria   DZ
4       American Samoa   AS
5              Andorra   AD
6               Angola   AO
7             Anguilla   AI
8           Antarctica   AQ
9  Antigua and Barbuda   AG

3) df.shape() :
Counting the rows and columns in DataFrame using shape(). It returns the no. of rows and columns enclosed in a tuple

In [5]:
df.shape

(249, 2)

4) df.describe : Summary of Statistics of DataFrame using describe() method.

In [6]:
df.describe()

               Name Code
count           249  246
unique          249  246
top     Afghanistan   AF
freq              1    1

5) df.dropna() : Dropping the missing values in DataFrame, it can be done using the dropna() method, it removes all the NaN values in the dataframe.

In [ ]:
df.dropna()

            Email_Id
0  Lalitha@gmail.com
1  Chandru@gmail.com
2    Venky@gmail.com

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [9]:
data=['A','B','C']
df1=pd.DataFrame(data)

In [10]:
df1

   0
0  A
1  B
2  C

In [17]:
data=['A','B','C']
df1=pd.DataFrame(data)
df1
reindex=[1,3,5]
print(df1.reindex(reindex))

     0
1    B
3  NaN
5  NaN

In [18]:
# import numpy and pandas module
import pandas as pd
import numpy as np

column =['a', 'b', 'c', 'd', 'e']
index =['A', 'B', 'C', 'D', 'E']

# create a dataframe of random values of array
df1 = pd.DataFrame(np.random.rand(5, 5),
	columns = column, index = index)

column =['a', 'b', 'c', 'g', 'h']

# create the new index for columns
print(df1.reindex(column, axis ='columns', fill_value ='data missing'))

          a         b         c             g             h
A  0.340271  0.938381  0.391182  data missing  data missing
B  0.646038  0.222934  0.734607  data missing  data missing
C  0.351323  0.709396  0.720735  data missing  data missing
D  0.600742  0.952960  0.146079  data missing  data missing
E  0.428738  0.753830  0.349576  data missing  data missing

In [24]:
import pandas as pd
import numpy as np

index =['a', 'b', 'c']
columns =['A', 'B', 'C']

# create a dataframe of random values of array
df1 = pd.DataFrame(np.random.rand(3, 3),
	columns = columns, index = index)

print(df1)

column =['1', '3', '5']

# create the new index for columns
print(df1.reindex(column, axis ='columns', fill_value ='data missing'))

          A         B         C
a  0.227747  0.151901  0.354273
b  0.184065  0.949856  0.005471
c  0.512010  0.856411  0.420409
              1             3             5
a  data missing  data missing  data missing
b  data missing  data missing  data missing
c  data missing  data missing  data missing

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.
For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [50]:
data={ 'Values' : [10,20,30,40,50] }
df3=pd.DataFrame(data)
df3

   Values
0      10
1      20
2      30
3      40
4      50

In [52]:
for index, row in df3.iterrows() :
    print(row["Values"])

10
20
30
40
50

In [69]:
df4=df3.sum()

In [70]:
df4

Values    150
dtype: int64

In [76]:
df4=df3.sum().iloc[0:3]

In [77]:
df4

Values    150
dtype: int64

In [78]:
df4=df3.iloc[0:3]

In [79]:
df4

   Values
0      10
1      20
2      30

In [80]:
df5=df4.sum()

In [81]:
df5

Values    60
dtype: int64

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [90]:
data={'Text' : "Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects."}

In [83]:
data
index=[1]

{'Text': "Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects."}

In [92]:
df6=pd.DataFrame(data,index=["Text1"])

In [93]:
df6

                                                    Text
Text1  Data Science Masters course is highly curated ...

In [95]:
df6["Length"]=df6.apply(lambda x : len(x))

In [96]:
df6

                                                    Text  Length
Text1  Data Science Masters course is highly curated ...     NaN

In [97]:
def test(x) :
    return len(x.split())

In [98]:
test("My name is Lalitha")

4

In [103]:
df6["Length"] =df6["Text"].apply(lambda x : len(x.split()))

In [104]:
df6

                                                    Text  Length
Text1  Data Science Masters course is highly curated ...      96

Q5. How are DataFrame.size() and DataFrame.shape() different?

Syntax: dataframe.size
Return : Returns size of dataframe/series which is equivalent to total number of elements. That is rows x columns.

Syntax: dataframe.shape
Return : Returns tuple of shape (Rows, columns) of dataframe/series

Syntax: dataframe.ndim
Return : Returns dimension of dataframe/series. 1 for one dimension (series), 2 for two dimension (dataframe)

In [1]:
# importing pandas module
import pandas as pd

# making data frame
data = pd.read_csv("https://media.geeksforgeeks.org/wp-content/uploads/nba.csv")

# dataframe.size
size = data.size

# dataframe.shape
shape = data.shape

# dataframe.ndim
df_ndim = data.ndim

# series.ndim
series_ndim = data["Salary"].ndim

# printing size and shape
print("Size = {}\nShape ={}\nShape[0] x Shape[1] = {}".
format(size, shape, shape[0]*shape[1]))

# printing ndim
print("ndim of dataframe = {}\nndim of series ={}".
format(df_ndim, series_ndim))

Size = 4122
Shape =(458, 9)
Shape[0] x Shape[1] = 4122
ndim of dataframe = 2
ndim of series =1

Q6. Which function of pandas do we use to read an excel file?

In [ ]:
import pandas as pd

In [3]:
df=pd.read_excel

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.
The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [5]:
data={'Email_Id' : ['Lalitha@gmail.com','Chandru@gmail.com','Venky@gmail.com']}

In [6]:
data

{'Email_Id': ['Lalitha@gmail.com', 'Chandru@gmail.com', 'Venky@gmail.com']}

In [7]:
df=pd.DataFrame(data)

In [8]:
df

            Email_Id
0  Lalitha@gmail.com
1  Chandru@gmail.com
2    Venky@gmail.com

In [17]:
s='Lalitha@gmail.com'
def test(s) :
    return list(s.partition('@'))[0]

In [18]:
test('Chandru@gmail.com')

'Chandru'

In [21]:
df1=df['Email_Id'].apply(lambda x : test(x))

In [22]:
df1

0    Lalitha
1    Chandru
2      Venky
Name: Email_Id, dtype: object

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values:
A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2

Assignment

Data Science Masters

Your function should select the following rows: A B C
1 8 2 7
4 9 1 2
The function should return a new DataFrame that contains only the selected rows.

In [27]:
data = {
    'A': [3,8,6,2,9],
    'B' : [5,2,9,3,1],
    'C' :[1,7,4,5,2]
}

In [28]:
df10=pd.DataFrame(data)

In [29]:
df10

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [44]:
df10[['A','B']]

   A  B
0  3  5
1  8  2
2  6  9
3  2  3
4  9  1

In [50]:
result_df=df10[(df10['A'] > 5) & (df10['B'] < 9)]

In [51]:
result_df

   A  B  C
1  8  2  7
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [52]:
data={'Values' : [10,20,30,40,50]}

In [53]:
data

{'Values': [10, 20, 30, 40, 50]}

In [54]:
df13=pd.DataFrame(data)

In [55]:
df13

   Values
0      10
1      20
2      30
3      40
4      50

In [56]:
df13.describe()

          Values
count   5.000000
mean   30.000000
std    15.811388
min    10.000000
25%    20.000000
50%    30.000000
75%    40.000000
max    50.000000

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [57]:
data ={ 'Sales' :[11,22,33,44,55,66,77,88] ,'Date' :[ '1st Mar','2nd Mar','3rd Mar','4th Mar','5th Mar','6th Mar','7th Mar','8th Mar']}

In [58]:
data

{'Sales': [11, 22, 33, 44, 55, 66, 77, 88],
 'Date': ['1st Mar',
  '2nd Mar',
  '3rd Mar',
  '4th Mar',
  '5th Mar',
  '6th Mar',
  '7th Mar',
  '8th Mar']}

In [59]:
df15=pd.DataFrame(data)

In [69]:
df15

   Sales     Date
0     11  1st Mar
1     22  2nd Mar
2     33  3rd Mar
3     44  4th Mar
4     55  5th Mar
5     66  6th Mar
6     77  7th Mar
7     88  8th Mar

In [80]:
df15['Rolling Average']=df15['Sales'].rolling(window=7).mean()

In [81]:
df15

   Sales     Date  Rolling Average
0     11  1st Mar              NaN
1     22  2nd Mar              NaN
2     33  3rd Mar              NaN
3     44  4th Mar              NaN
4     55  5th Mar              NaN
5     66  6th Mar              NaN
6     77  7th Mar             44.0
7     88  8th Mar             55.0

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.
For example, if df contains the following values:
Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
Your function should create the following DataFrame:

Date Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday
The function should return the modified DataFrame.

In [119]:
pass

In [ ]:
import pandas as pd


df = pd.DataFrame({'my_dates':['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05','2023-01-06','2023-01-07']
                   })
df['my_dates'] = pd.to_datetime(df['my_dates'])

df['day_of_week'] = df['my_dates'].dt.day_name()

In [118]:
df

    my_dates day_of_week
0 2023-01-01      Sunday
1 2023-01-02      Monday
2 2023-01-03     Tuesday
3 2023-01-04   Wednesday
4 2023-01-05    Thursday
5 2023-01-06      Friday
6 2023-01-07    Saturday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [157]:
date={ 'Date' : ['01/01/2022','01/02/2023','11/11/2023','15/01/2023','02/02/2023']}

In [158]:
date

{'Date': ['01/01/2022',
  '01/02/2023',
  '11/11/2023',
  '15/01/2023',
  '02/02/2023']}

In [159]:
df31=pd.DataFrame(date)

In [160]:
df31

         Date
0  01/01/2022
1  01/02/2023
2  11/11/2023
3  15/01/2023
4  02/02/2023

In [161]:
df31["My_Dates"]=pd.to_datetime(df31['Date'])

/tmp/ipykernel_84/1384242102.py:1: UserWarning: Parsing dates in DD/MM/YYYY format when dayfirst=False (the default) was specified. This may lead to inconsistently parsed dates! Specify a format to ensure consistent parsing.
  df31["My_Dates"]=pd.to_datetime(df31['Date'])

In [162]:
df31

         Date   My_Dates
0  01/01/2022 2022-01-01
1  01/02/2023 2023-01-02
2  11/11/2023 2023-11-11
3  15/01/2023 2023-01-15
4  02/02/2023 2023-02-02

In [163]:
df32=df31[(df31['My_Dates'] >='2023-01-01')  & (df31['My_Dates'] <='2023-01-31')]

In [164]:
df32

         Date   My_Dates
1  01/02/2023 2023-01-02
3  15/01/2023 2023-01-15